Repository: gosa-project/gosa-plugins-schoolmanager
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: de

source: Import Students (only)
de: Nur Schüler Importieren

source: GOsa2 School Manager Module: Import Students (only)
de: GOsa²-Schulverwaltungsmodul: Nur Schüler Importieren

source: SchoolManager class group %s
de: GOsa² Schulverwaltung: Klassengruppe %s

source: SchoolManager course group %s
de: GOsa² Schulverwaltung: Kursgruppe %s

source: Archive Accounts
de: Benutzerkonten Archivieren

source: GOsa2 School Manager Module: Archive Accounts
de: GOsa² Schulverwaltung: Benutzerkonten archivieren

source: Step 3:
de: Schritt 3:

source: Statistics
de: Statistiken

source: The clean-up process of SchoolManager-managed groups has been complete successfully, now. SchoolManager is ready for importing a new school year, now.
de: Die Bereinigung der vom Schulverwaltungs-Add-On verwalteten Gruppen wurde nun erfolgreich abgeschlossen. Das Schulverwaltungs-Add-On ist jetzt bereit ein neues Schuljahr zu importieren.

source: Emptied class groups: %1, already empty: %2
de: Klassengruppen geleert: %1, bereits leer: %2

source: Emptied course groups: %1, already empty: %2
de: Kursgruppen geleert: %1, bereits leer: %2

source: Emptied subject groups: %1, already empty: %2
de: Fachgruppen geleert: %1, bereits leer: %2

source: Emptied parent groups: %1, already empty: %2
de: Elterngruppen geleert: %1, bereits leer: %2

source: Some groups were found in the SchoolManager area (OU) that should be moved out of there, please introspect manually. Let this be done by someone with LDAP expertise.
de: Es wurden einige Gruppen im vom Schulverwaltungs-Add-On verwalteten Bereich (i.d.R. ou=SchoolManager) gefunden, welche aus diesem Bereich entfernt und in einen anderen, passenderen Bereich verschoben werden sollten, bitte prüfen Sie dies manuell. Dies sollte von jemanden mit guten LDAP-Kenntnissen gemacht werden.

source: Ignored POSIX groups: %1, already empty: %2
de: POSIX-Gruppen ignoriert: %1, bereits leer: %2

source: Ignored object groups: %1, already empty: %2
de: Objektgruppen ignoriert: %1, bereits leer: %2

source: You can continue with importing teacher accounts now. You can use the &quot;Import Teachers&quot; SchoolManager module for this.
de: Sie können nun damit fortfahren, die Nutzerkonten für Lehrer zu importieren. Dafür können Sie das Schulverwaltungs-Add-On Module &quot;Lehrer Importieren&quot; verwenden.

source: Step 1:
de: Schritt 1:

source: Empty SchoolManager administered standard (POSIX) groups
de: Leere Standardgruppen (POSIX), die vom Schulverwaltungs-Add-On verwaltet werden

source: The following list shows all POSIX groups (classes, courses and teachers' subjects) managed by SchoolManager. You are about to empty all listed groups, i.e.: drop all members from those groups.
de: Die folgende Liste zeigt alle POSIX Gruppen (Klassen, Kurse und die Fächer von Lehrern) welche durch das Schulverwaltungs-Add-On verwaltet werden. Sie sind im Begriff alle aufgeführten Gruppen zu leeren (d.h. alle Mitglieder aus den Gruppen zu entfernen).

source: With the next import of teachers or students, many of these groups will get automatically re-populated with members. If you are at the beginning of a new school year, you want to do this!
de: Beim nächsten Import von Lehrern oder Schülern werden viele dieser Gruppen automatisch wieder mit Mitgliedern gefüllt werden. Zu Beginn eines neuen Schuljahres, ist dies genau das, was Sie tun wollen.

source: Flush all members from the listed course, class and subject (POSIX) groups now? After you have clicked this button, the process cannot be reverted!. Emptying all groups may take some time, so please be patient while waiting...
de: Alle Mitglieder aus den aufgeführten Kurs-, Klassen- und Fachgruppen (POSIX) entfernen? Nachdem Sie diesen Knopf gedrückt haben, kann der Vorgang nicht mehr rückgängig gemacht werden! Das Leeren aller Gruppen kann einige Zeit dauern, bitte haben Sie dafür etwas Geduld...

source: Really empty all POSIX groups listed below, now!
de: Jetzt wirklich alle Benutzer aus den unten gelisteten POSIX-Gruppen austragen!

source: POSIX Group: %1
de: POSIX-Gruppe: %1

source: Group Name
de: Gruppenname

source: Description
de: Beschreibung

source: Members (to be removed)
de: Mitglieder (zu entfernen)

source: (none)
de: (kein/e)

source: Step 2:
de: Schritt 2:

source: Empty SchoolManager administered object groups
de: Leere Objektgruppen, die durch das Schulverwaltungs-Add-On verwaltet werden

source: The following list shows all parent groups managed by SchoolManager. You are about to empty all listed groups, i.e.: drop all members from those groups.
de: Die folgende Liste zeigt alle Elterngruppen, welche durch das Schulverwaltungs-Add-On verwaltet werden. Sie sind im Begriff, alle Mitglieder aus den aufgeführten Gruppen zu entfernen.

source: With the next import of students (and their parents), many of these parent groups will get automatically re-populated with members. At the beginning of a new school year, you want to do this!
de: Beim nächsten Import von Schülern (und deren Eltern) werden viele dieser Elterngruppen automatisch wieder mit Mitgliedern befüllt werden. Zu Beginn eines neuen Schuljahres, ist dies genau das, was Sie tun wollen.

source: Flush all members from the listed parent (object) groups now? After you have clicked this button, the process cannot be reverted! Emptying all groups may take some time, so please be patient while waiting...
de: Alle Mitglieder aus den aufgeführten Elterngruppen (Objektgruppen) entfernen? Nachdem Sie diesen Knopf gedrückt haben, kann der Vorgang nicht mehr rückgängig! Das Leeren aller Gruppen kann einige Zeit dauern, bitte haben Sie dafür etwas Geduld...

source: Really empty all parent (object) groups listed below, now!
de: Jetzt wirklich alle Eltern aus den unten gelisteten Objektgruppen austragen!

source: Group object: %1
de: Gruppenobjekt: %1

source: Introduction
de: Einführung

source: GOsa2 School Manager Module: Introduction
de: GOsa² Schulverwaltung: Einführung

source: GOsa2 School Manager's <b>Archive Old Accounts</b> has not been implemented, yet.
de: Das <b>Nutzerkonten Archivieren</b> Modul für GOsa² Schulverwaltung ist leider noch nicht implementiert.

source: Introduction to GOsa2's School Manager Add-On
de: Einführung in das GOsa² Schulverwaltungs-Add-On

source: General Information
de: Allgemeine Informationen

source: The SchoolManager Add-On for GOsa2 has been designed as an advanced LDAP import tool for user and group management at schools. In our experience, schools have several special needs uncommon to other IT setups, e.g.:
de: Das Schulverwaltungs-Add-On für GOsa² wurde als fortgeschrittenes LDAP-Importwerkzeug für Benutzer- und Gruppenverwaltung an Schulen entwickelt. Unserer Erfahrung nach haben Schulen einige sehr spezielle Anforderungen, die anders als in anderen IT-Umgebungen sind, z.Bsp.:

source: Many users come and go every year.
de: Jedes Jahr kommen und gehen viele Benutzer.

source: Group memberships may change every half year.
de: Gruppen-Mitgliedschaften können sich jedes halbe Jahr ändern.

source: Each student comes with parents that are also involved in school IT (e.g., home page login).
de: Zu jedem Schüler gehören Eltern, die gegebenenfalls auch Teile der Schul-IT mitnutzen sollen (z.Bsp. Login auf der Schulhomepage).

source: With this SchoolManager Add-On you can mass create user accounts for teachers, students and parents via importing two (large) CSV files. Most school offices run school administration tools, that can provide such CSV files as required by GOsa2's SchoolManager Add-On.
de: Mit diesem Schulverwaltungs-Add-On können Sie in großem Umfang Benutzerkonten für Lehrer, Eltern und Schüler erstellen, indem Sie zwei (große) CSV-Dateien importieren. Die meisten Schulen nutzen Verwaltungssoftware, welche solche CSV-Dateien zur Verfügung stellen können, wie sie durch das Schulverwaltungs-Add-On für GOsa² benötigt werden.

source: From the CSV file, various information gets extracted:
de: Verschiedene Informationen werden aus der CSV-Datei extrahiert:

source: Personal data (name, date of birth, unique ID) as stored in the school administration software
de: Persönliche Daten (Name, Geburtsdatum, Hauptbuchnummer), so wie sie in der Schulverwaltungssoftware gespeichert sind

source: Teachers: class teacher, taught subjects, taught courses
de: Lehrer: Klassenlehrer, unterrichtete Fächer, unterrichtete Kurse

source: Students: each student normally comes with one or two parents that also may need accounts in LDAP
de: Schüler: Jeder Schüler hat normalerweise ein oder zwei Eltern, welche eventuell auch Benutzerkonten in LDAP brauchen

source: Students and teachers are grouped by classes and courses
de: Schüler und Lehrer sind nach Klassen und Kursen gruppiert.

source: Students and their parents are bound together via parent groups
de: Schüler und ihre Eltern sind durch Elterngruppen miteinander verknüpft

source: Mail addresses of teachers, students and parents.
de: Email-Adressen von Lehrern, Eltern und Schülern.

source: SchoolManager is idempotent
de: Das Schulverwaltungs-Add-On ist idempotent

source: The import algorithm in SchoolManager is idempotent. This means you can import the same CSV file several times without endangering already existing accounts. If some of the information in the CSV file has changed, the correlating LDAP objects (users/groups) will be adapted.
de: Der Import-Algorithmus, den das Schulverwaltungs-Add-On verwendet, ist idempotent. Das heißt, Sie können die gleiche CSV-Datei mehrere Male importieren, ohne Gefahr zu laufen, vorhandene Benutzerkonten zu überschreiben oder ungewollt zu ändern. Wenn Informationen in der CSV-Datei geändert wurden, werden die entsprechenden LDAP Objekte (Benutzer/Gruppen/Fächer) angepasst.

source: Nothing Gets Deleted...
de: Nichts wird gelöscht...

source: In SchoolManager, there is this concept of not deleting any LDAP information, ever.
de: Ein Konzept des Schulverwaltungs-Add-Ons ist, dass niemals LDAP-Informationen gelöscht werden.

source: POSIX (UniX) user accounts and POSIX groups always have their representation on the servers' file system level. Files and folders in home and group directories are owned by a specific user and a specific group. Technically, the mapping between users/groups and file system permissions happens through numbers: UID number, GID number.
de: Alle POSIX-(UniX)-Benutzerkonten und POSIX-Gruppen hinterlassen ihre Spuren auf den Dateisystemen von Servern. Dateien und Ordner in Benutzer- und Gruppenverzeichnissen gehören einem bestimmten Benutzer oder einer bestimmten Gruppe. Genau gesehen geschieht die Verknüpfung zwischen Benutzern/Gruppen und Zugriffsrechten im Dateisystem durch Nummern: UID-Nummer, GID-Nummer.

source: If accounts / groups get removed from LDAP, it may occur that UID numbers and GID numbers of removed users and groups get re-used for new LDAP user accounts or LDAP groups. This might lead to unwanted access to data on the file system level. The new user can potentially access files created by the removed user who formerly owned the new user's UID number. Same, in theory, applies for groups and GID numbers.
de: Wenn Benutzerkonten/Gruppen aus LDAP entfernt werden, kann es vorkommen, dass UID-Nummern und GID-Nummern der entfernten Benutzer und Gruppen für neue LDAP-Benutzerkonten oder LDAP-Gruppen wieder verwendet werden. Dies kann zu ungewolltem Zugriff auf Daten im Dateisystem führen. Der neue Benutzer kann eventuell auf Daten zugreifen, welche durch den gelöschten Benutzer, dem die UID-Nummer des neuen Benutzers zuvor zugeordnet war, erstellt wurden. Dies gilt theoretisch auch für Gruppen und GID-Nummern.

source: SchoolManager's solution to this is: keep all user and group objects in LDAP forever. User objects (i.e. their user ID) can be renamed with the &quot;Archive Accounts&quot; module, so that nice and short user IDs stay available on your school site.
de: Die Lösung für dieses Problemes im Schulverwaltungs-Add-On: Alle Benutzer- und Gruppenobjekte bleiben dauerhaft in LDAP gespeichert. Benutzerobjekte (d.h. deren Anmeldenamen) können mit dem &quot;Benutzerkonten Archivieren&quot; Modul umbenannt werden, damit kurze und einfach zu nutzende Anmeldenamen für Ihre Schulumgebung verfügbar bleiben.

source: First time usage
de: Erste Verwendung

source: If you are using the SchoolManager Add-On for GOsa2 for the first time, please follow these steps:
de: Wenn Sie das Schulverwaltungs-Add-On für GOsa² das erste Mal einsetzen, folgen Sie bitte diesen Schritten:

source: First, finish up reading all information provided by this introduction.
de: Als erstes lesen Sie bitte alle Informationen, die in dieser Einführung bereitgestellt werden.

source: Then, change to the Directory Structure Management view of GOsa2.
de: Danach wechseln Sie in die Verzeichnisstruktur-Ansicht von GOsa².

source: Create a GOsa2 Department with the name &quot;SchoolManager&quot; at a location of your choice within the LDAP tree.
de: Erstellen Sie eine GOsa²-Abteilung mit dem Namen &quot;SchoolManager&quot; an einer Stelle Ihrer Wahl innerhalb des LDAP-Baumes.

source: Return to the SchoolManager Add-On again and start importing students and/or teachers. When switching to the &quot;Student Management&quot; or the &quot;Teacher Management&quot; tabs, you will find more information on the requirements regarding the CSV import files. Our recommendation is: start with importing the teacher accounts.
de: Wechseln Sie zurück zu diesem Schulverwaltungs-Add-On und beginnen Sie damit Schüler und/oder Lehrer zu importieren. Wenn Sie zum &quot;Schüler und Eltern Importieren&quot; oder &quot;Lehrer Importieren&quot; Tab wechseln, werden Sie mehr Informationen zu den Anforderungen für die zu importierenden CSV-Dateien finden. Unsere Empfehlung ist: beginnen Sie mit dem Import der Nutzerkonten für Lehrer.

source: Preparing a new School Year
de: Ein neues Schuljahr vorbereiten

source: SchoolManager creates various groups (POSIX groups, LDAP DN groups) on user import. These groups get stored at a special location of the LDAP tree.
de: Das Schulverwaltungs-Add-On erstellt beim Benutzerimport mehrere Gruppen (POSIX Gruppen, LDAP DN Gruppen). Diese Gruppen werden an einer gesonderten Stelle im LDAP-Baum gespeichert.

source: With the start of a new school year, we recommend flushing all members from these groups, i.e. class, course, subject and parent groups. After that, continue with importing all teachers first, and then proceed with the student imports.
de: Zu Beginn eines neuen Schuljahrs empfehlen wir, alle Mitglieder aus existierenden Klassen- und Kursgruppen auszutragen. Danach sollte dann zunächst der Import der Lehrer erfolgen, und anschließend importieren Sie die Konten der Schüler.

source: OU container for groups managed by SchoolManager:
de: OU-Container für Gruppen, die vom Schulverwaltungs-Add-On verwaltet werden:

source: Flush all members from course, class, subject and parent groups now? If you click this button, SchoolManager presents to you a list of to be emptied groups and asks for confirmation before actually performing this clean-up task.
de: Alle Mitglieder aus Kurs-, Fach- und Elterngruppen austragen? Wenn Sie diesen Knopf drücken, wird, bevor mit den Aufraumarbeiten begonnen wird, eine Liste der zu leerenden Gruppen angezeigt und noch einmal eine Bestätigung abgefragt.

source: Empty all SchoolManager groups now!
de: Leere alle vom Schulverwaltungs-Add-On verwalteten Gruppen jetzt!

source: Updating User Information During the Term
de: Benutzerinformationen während des Schuljahres aktualisieren

source: In the middle of a school year, you can easily update student, teacher and partent accounts, by importing a subset of the complete CSV file. Simply import the data of students and/or teachers that require being updated or added.
de: Auch mitten im Schuljahr können einfache Anpassungen an den Benutzerkonten von Eltern, Schülern und Lehrern vorgenommen werden. Dies geschieht, indem Sie nur einen Teil einer kompletten CSV-Datei importieren. Importieren Sie einfach die Daten der Schüler/Eltern/Lehrer, welche aktualisiert oder neu hinzugefügt werden sollen.

source: You can, of course, also upload the complete data set, but this will take far too long, if only some account information have changed (e.g. new parent email address).
de: Sie können natürlich auch den kompletten Datenbestand hochladen, aber dies dauert viel zu lange, dafür dass nur einige Benutzerkonteninformationen zu ändern sind (z. Bsp. eine neue E-Mailadresse bei einem Elternteil).

source: Localization and Regional Adaptations
de: Übersetzung und regionale Anpassungen

source: The SchoolManager add-on for GOsa2 has been developed with the German school system in mind, more specifically the school system as found in the Nothern German county Schleswig-Holstein.
de: Das Schulverwaltungs-Add-On für GOsa² wurde hauptsächlich für das Deutsche Schulsystem entwicklt, wie es in den Schulen des Norddeutschen Bundeslandes Schleswig-Holstein typisch ist.

source: If you intend using SchoolManager on your GOsa2 site but find that it does not at all fill you needs, this may be due to regional differences in how schools get administered all over the world. Don't give up, SchoolManager can be adapted/extended to your needs.
de: Wenn Sie vorhaben, das Schulverwaltungs-Add-On zur Verwaltung Ihrer GOsa²-Installation zu verwenden, aber feststellen, dass nicht alle Ihre Bedürfnisse abgedeckt werden, dann kann dies an den regionalen Unterschieden in der Verwaltung von Schulen weltweit liegen. Nicht aufgeben, das Schulverwaltungs-Add-On kann an Ihre Bedürfnisse angepasst werden.

source: Please get in touch with the GOsa2 developers on Github and we will see, what we can do for you:
de: Bitte setzen Sie sich via Github mit den Entwicklern von GOsa² in Verbindung und wir werden schauen, was wir für Sie tun können:

source: With GOsa2 School Manager's <b>Import Students and Parents Module</b> you can import student user accounts, parent accounts, class groups and course groups from a single CSV file containing one user's account information per line.
de: Mit dem <b>Eltern und Schüler Importieren</b> Modul des GOsa² Schulverwaltungs-Add-Ons können Schüler/Studenten-Konten, Elternkonten und Klassen- bzw. Kursgruppen aus einer CSV-Datei, in der pro Zeile die Daten eines Benutzerkontos stehen importiert werden.

source: With GOsa2 School Manager's <b>Import Teachers Module</b> you can import teacher user accounts, class groups, course groups and subject groups from a single CSV file containing one user's account information per line.
de: Mit dem <b>Lehrer Importieren</b> Modul des GOsa² Schulverwaltungs-Add-Ons können Lehrer-Konten und Klassen- bzw. Kursgruppen aus einer CSV-Datei, in der pro Zeile die Daten eines Benutzerkontos stehen, importiert werden.

source: With GOsa2 School Manager's <b>Import Students (only) Module</b> you can import student user accounts, class groups and course groups from a single CSV file containing one user's account information per line.
de: Mit dem <b>Nur Schüler Importieren</b> Modul des GOsa² Schulverwaltungs-Add-Ons können Schüler/Studenten-Konten, Klassen- bzw. Kursgruppen aus einer CSV-Datei, in der pro Zeile die Daten eines Benutzerkontos stehen importiert werden.

source: STEP %1: Upload CSV File
de: Schritt %1: CSV-Datei hochladen

source: The data provided via the uploadable CSV file needs to be of the following data format:
de: Der Datensatz, der in Form einer CSV-Datei hochgeladen wird, muss den folgenden Formatierungsrichtlinien genügen:

source: Column
de: Spalte

source: Number
de: Nummer

source: This is useful for discussing issues with CSV import files, but the number column is normally not used.
de: Dies ist nützlich, wenn Probleme mit einer CSV-Datei besprochen werden müssen. Normalerweise wird die "Nummer"-Spalte aber nicht verwendet.

source: Login
de: Anmeldename

source: The user account's login ID. If left empty, it will be attempted to auto-generated a login ID.
de: Der Anmeldename des Benutzerkontos. Wird dies frei gelassen, wird ein Anmeldename automatisch generiert.

source: Password
de: Passwort

source: The user's password. If left empty, a password will be generated during the import.
de: Das Benutzerkennwort. Wird dies frei gelassen, wird ein Kennwort automatisch beim Import erstellt.

source: Student ID
de: Hauptbuchnummer

source: An unequivocal number that a student is associated with in the school's administration software.
de: Eine eindeutige Nummer, anhand der ein Schüler in der Verwaltungssoftware der Schule gefunden werden kann.

source: Last Name(s)
de: Nachname(n)

source: The student's last name(s).
de: Der Nachname des/r Schülers/in.

source: First Name(s)
de: Vorname(n)

source: The student's first and middle name(s).
de: Vor- und Mittelnamen(n) des/r Schüler/in.

source: Date of Birth
de: Geburtsdatum

source: The student's date of birth. This field is an obligatory field as it is used to distinguish accounts with identical first and last names.
de: Das Geburtsdatum des/r Schüler/in. Dies ist ein Pflichtfeld, weil es dazu verwendet wird, Benutzer mit identischen Vor- und Zunamen zu unterscheiden.

source: Gender
de: Geschlecht

source: The student's gender (male / female / ...).
de: Das Geschlecht des/r Schülers/in (männlich / weiblich / ... ). Auch ein Pflichtfeld.

source: Class
de: Klasse

source: The class name / identifier.
de: Der Klassenname.

source: Last Name (Parent 1)
de: Nachname (Elternteil 1)

source: Last name of parent 1 (e.g. mother).
de: Nachname des ersten Elternteils (z.Bsp. Mutter).

source: First Name (Parent 1)
de: Vorname (Elternteil 1)

source: First (and middle) name(s) of parent 1.
de: Vor-(und Mittel-)Name(n) des ersten Elternteils.

source: Mail Address (Parent 1)
de: E-Mail Adresse (Elternteil 1)

source: Mail address of parent 1.
de: E-Mail Adresse des ersten Elternteils.

source: Last Name (Parent 2)
de: Nachname (Elternteil 2)

source: Last name of parent 2 (e.g. father).
de: Nachname des zweiten Elternteils (z.Bsp. Vater).

source: First Name (Parent 2)
de: Vorname (Elternteil 2)

source: First (and middle) name(s) of parent 2.
de: Vor-(und Mittel-)Name(n) des zweiten Elternteils.

source: Mail Address (Parent 2)
de: E-Mail Adresse (Elternteil 2)

source: Mail address of parent 2.
de: E-Mail Adresse des zweiten Elternteils.

source: Courses
de: Unterrichtskurse

source: Courses a student is signed up for (one per column, use as many columns as needed).
de: Unterrichtskurse, an denen ein/e Schüler/in teilnimmt (ein Kurs pro Spalte, es können so viele Spalten verwendet werden, wie notwendig ist).

source: This is useful for manual discussing issues with CSV import files, but the number column is normally not used.
de: Dies ist nützlich, wenn Probleme mit einer CSV-Datei besprochen werden müssen. Normalerweise wird die "Nummer"-Spalte aber nicht verwendet.

source: Last Name
de: Nachname

source: The teacher's last name(s).
de: Der Nachname des/r Lehrer/in.

source: First Name
de: Vorname

source: The teacher's first (and middle) name(s).
de: Der Vor-(und Mittel-)Name des/r Lehrer/in.

source: The teachers's date of birth. This field is an obligatory field as it is used to distinguish accounts with identical first and last names.
de: Das Geburtsdatum des/r Lehrer/in. Dies ist ein Pflichtfeld, weil es dazu verwendet wird, Benutzer mit identischen Vor- und Zunamen zu unterscheiden.

source: Subjects
de: Fächer

source: The subjects a teacher can teach / is trained for.
de: Die Fächerkombination, die von einem/r Lehrer/in unterrichtet wird.
