Repository: gosa-project/gosa-plugins-schoolmanager
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: de

source: The primary class a teacher is assigned to. If the teacher is not a class teacher, then leave empty.
de: Die Klasse, von der der Lehrer Klassenlehrer ist. Wenn der Lehrer kein Klassenlehrer ist, bitte frei lassen.

source: Courses a teacher teaches (one per column, use as many columns as needed).
de: Kurse, die ein Lehrer unterrichtet (ein Kurs je Spalte, es können so viele Spalten verwendet werden, wie notwendig ist).

source: Upload CSV File
de: CSV-Datei hochladen

source: Select CSV file with students' and their parents' data to import:
de: CSV-Datei mit den zu importierenden Daten der Eltern und Schüler auswählen:

source: Select CSV file with teachers' data to import:
de: CSV-Datei mit den Daten der zu importierenden Lehrer auswählen:

source: Select CSV file with students' data to import:
de: CSV-Datei mit den Daten der zu importierenden Schüler auswählen:

source: Browse
de: Durchsuchen

source: CSV format options:
de: CSV Formateinstellungen:

source: First line in CSV file contains column headers (so ignore that first line):
de: Die erste Zeile der CSV-Datei enhält sog. Spaltenköpfe (insofern bitte die erste Zeile ignorieren):

source: Delimiter for column fields in CSV file:
de: Spalten-Trennzeichen zwischen Datenzellen in der CSV-Datei:

source: Note:
de: Hinweis:

source: The following filters are automatically applied on CSV file import...
de: Die folgenden Filter werden automatisch auf die CSV-Datei angewendet...

source: Auto-detection of charset encoding (everything gets converted internally to UTF-8)
de: Automatisch Erkennung der Zeichen-Enkodierung (alles wird intern nach UTF-8 konvertiert)

source: Single and double quotes next to the field delimiters get removed
de: Einzelne und doppelte Anführungszeichen neben den Spalten-Trennzeichen werden entfernt

source: MS-DOS / Unix line ending style gets recognized automatically and processed accordingly
de: MS-DOS- bzw. Unix-konforme Sonderzeichen am Zeilenende werden automatisch erkannt und entsprechend verarbeitet

source: STEP %1: Configure import options
de: STEP %1: Importoptionen konfigurieren

source: School Manager's import functionality is very flexible and can be adapted to your needs. Please configure options of this import below.
de: Die Importfunktion des Schulverwaltungs-Add-Ons ist sehr flexibel und kann an die eigenen Bedürfnisse angepasst werden. BItte weiter unten die Optionen dieses Imports einstellen.

source: Configure import options
de: Importoptionen konfigurieren

source: Please choose from the available GOsa2 user object templates what account templates to use for students and for their parents.
de: Bitte für die Erstellung von Schüler/Studenten- und Eltern-Konten jeweils eine der in GOsa² verfügbaren Benutzerobjektvorlagen auswählen.

source: Select template for student accounts
de: Vorlagen für Schüler-Konten auswählen

source: Select template for parent accounts
de: Vorlage für Elternkonten auswählen

source: Create a sub-OU for each class and place student accounts belonging to the same class into their corresponding class OU?
de: Für jede Klasse eine eigene Unter-OU erstellen und Benutzerkonten von SuS unterhalb der jeweiligen OU ablegen?

source: (tick this check box, if yes)
de: (falls ja, dieses Kästchen markieren)

source: If CSV data does not contain a user ID (uid) column, use the mail address as user ID instead?
de: Wenn die CSV-Daten keine Spalte für die Benutzerkennung (uid) beinhalten, soll versucht werden, die Mailadresse als Benutzerkennung zu verwenden?

source: Please choose from the available GOsa2 user object templates what account template to use for teachers.
de: Bitte für die Erstellung von Lehrer-Konten eine der in GOsa² verfügbaren Benutzerobjektvorlagen auswählen.

source: Select template for teacher accounts
de: Vorlage für Lehrer-Konten auswählen

source: Make all teachers teaching courses in a class members of that class group?
de: Lehrer, die ein Fach in der Klasse unterrichten, zu Mitgliedern der Klassengruppe machen?

source: Please choose from the available GOsa2 user object templates what account templates to use for students.
de: Bitte für die Erstellung von Schüler-Konten eine der in GOsa² verfügbaren Benutzerobjektvorlagen auswählen.

source: During this import we will probably create several non-primary groups (for classes, courses). Where in the LDAP tree shall these new group objects be created?
de: Während dieses Imports werden wahrscheinlich einige nicht-primäre Gruppen (für Klassen, Kurse) erstellt werden. Wo im LDAP-Baum sollen diese Gruppenobjekte erstellt werden?

source: Select OU for new groups:
de: OU für neue Gruppen auswählen:

source: And what mail domain should these new groups be in?
de: Und in welcher Maildomäne sollen diese neuen Gruppen sein?

source: Mail domain for new groups:
de: Maildomäne für neue Gruppen:

source: Please select the Attributes which will identify users from the CSV file and existing users
de: Bitte wählen sie die Attribute aus, die dazu verwendet werden sollen, existierende Benutzer in der CSV-Datei zu identifizieren

source: Surname
de: Vorname

source: STEP %1: Check CSV data and assign to LDAP attributes
de: Schritt %1: CSV-Daten überprüfen und LDAP-Attributen zuweisen

source: Please assign the offered (LDAP) attributes to the CSV data columns. Note that the CSV file has been rotated 90DEGREES counter-clockwise for better readability.
de: Bitte die angebotenen (LDAP-)Attribute den Spalten des CSV-Datensatzes zuweisen. Die CSV-Datei wurde zur besseren Lesbarkeit um 90° gegen den Uhrzeigersinn gedreht.

source: Check CSV data
de: Prüfe CSV-Datensatz

source: STEP %1: Review user account objects before LDAP import
de: Schritt %1: Benutzerobjekte vor LDAP-Import überprüfen

source: STEP %1 (LDAP import status): User account objects have been imported into LDAP
de: Schritt %1 (LDAP-Importstatus): Benutzerobjekte wurden nach LDAP importiert.

source: STEP %1 Review group memberships before LDAP update
de: Schritt %1: Gruppenmitgliedschaften vor LDAP-Import überprüfen

source: STEP %1 (LDAP import status): Accounts' group memberships have been updated in LDAP
de: Schritt %1 (LDAP-Importstatus): Gruppenmitgliedschaften der Nutzerkonten wurden in LDAP aktualisiert

source: User account: %1, %2
de: Benutzerkonto: %1, %2

source: New user account: %1, %2
de: Neues Benutzerkonto: %1, %2

source: Account group for %1, %2
de: Kontogruppen für %1, %2

source: <keep>
de: <unverändert-lassen>

source: Groups
de: Gruppen

source: Group membership actions
de: Gruppenmitgliedschaftsaktionen

source: New associated account: %1, %2
de: Neues assoziiertes Konto: %1, %2

source: Insufficient account data: %1, %2
de: Unzureichende Kontodaten: %1, %2

source: Associated account: %1, %2
de: Assoziiertes Konto: %1, %2

source: STEP %1: Review group objects before LDAP import
de: Schritt %1: Gruppenobjekte vor LDAP-Import überprüfen

source: STEP %1 (LDAP import status): Group objects have been imported into LDAP
de: Schritt %1 (LDAP-Importstatus): Gruppenobjekte wurden in LDAP importiert.

source: Standard (POSIX) groups
de: Standard-(POSIX)-Gruppen

source: Object groups
de: Objektgruppen

source: STEP %1: LDAP import completed. Statistical overview of all import actions.
de: Schritt %1: LDAP-Import abgeschlossen. Statistische Übersicht über alle Importaktionen.

source: All entries have been written to the LDAP database successfully.
de: Alle Einträge wurden erfolgreich in die LDAP-Datenbank geschrieben.

source: There has been at least one error during the import of your data.
de: Es ist mindestens ein Fehler während des Datenimports aufgetreten.

source: Here is the status report for the import:
de: Hier ist der Statusbericht des Imports:

source: Continue here, when ready
de: Hier klicken, um fortzusetzen

source: Set import configuration option (Step %1)
de: Import konfigurieren (Schritt %1)

source: Check and Sort CSV Data (Step %1)
de: Prüfe und sortiere CSV-Daten (Schritt %1)

source: Review user account objects before LDAP import (Step %1)
de: Benutzerobjekte vor LDAP-Import prüfen (Schritt %1)

source: Continue here, when ready (this can take a while...)
de: Hier klicken, um fortzusetzen (dies kann eine Weile dauern...)

source: Import user account objects into LDAP (Step %1)
de: Benutzerkonten nach LDAP importieren (Schritt %1)

source: Review group objects (Step %1)
de: Gruppenobjekte prüfen (Schritt %1)

source: Import group objects into LDAP (Step %1)
de: Gruppenobjekte nach LDAP importieren (Schritt %1)

source: Review accounts' group memberships before LDAP import (Step %1)
de: Gruppenmitgliedschaften vor LDAP-Import prüfen (Schritt %1)

source: Update accounts' group memberships in LDAP (Step %1)
de: Gruppenmitgliedschaften in LDAP aktualisieren (Schritt %1)

source: Some post-import clean-ups (Step %1)
de: Einige Aufräumarbeiten nach dem Import (Schritt %1)

source: Finish LDAP import (Step %1)
de: LDAP-Import abschließen (Schritt %1)

source: Cancel Import
de: Import abbrechen

source: Import Teachers
de: Lehrer Importieren

source: GOsa2 School Manager Module: Import Teachers
de: GOsa² Schulverwaltungsmodul: Lehrer Importieren

source: SchoolManager subject group %s
de: GOsa² Schulverwaltung: Fachschaftsgruppe %s

source: School Manager
de: Schulverwaltung

source: Administration Utility for Schools
de: Administrationswerkzeug für Schulen

source: Import Students and Parents
de: Eltern und Schüler Importieren

source: GOsa2 School Manager Module: Import Students and Parents
de: GOsa²-Schulverwaltungsmodul: Eltern und Schüler Importieren

source: parent group of user %s %s
de: Elterngruppe des Benutzers %s %s

source: Manage Accounts
de: Benutzerkontenmodul

source: GOsa2 School Manager super-class for managing accounts
de: GOsa² Schulverwaltung Super-Klasse für Accountverwaltung

source: komma separated values
de: Komma-getrennte Werte

source: semicolon separated values
de: Semikolon-getrennte Werte

source: tabstop separated values
de: Tabulator-getrennte Werte

source: blank separated values
de: Leerzeichen-getrennte Werte

source: Permission error
de: Berechtigungsfehler

source: You've no permission to import user data!
de: Sie haben nicht die Berechtigung, Benutzerdaten zu importieren!

source: Error
de: Fehler

source: Cannot read uploaded file: %s
de: Kann die hochzuladenen Datei nicht lesen: %s

source: file not found
de: Datei nicht gefunden

source: file is empty
de: Datei ist leer

source: file not readable
de: Datei ist nicht lesbar

source: File has an unsupported encoding!
de: Textenkodierung der Datei wird nicht unterstützt!

source: Cannot find CSV data in the selected file!
de: Es können keine CSV-Daten in der ausgewählten Datei gefunden werden!

source: Domain for new groups is empty!
de: Maildomäne für neue Gruppen ist leer!

source: The attribute %s is only allowed to select once!
de: Das Attribut %s darf nur einmal verwendet werden!

source: male
de: männlich

source: female
de: weiblich

source: Need at least %s and %s to create users (Check line %d in CSV file)!
de: Brauche mindestens %s und %s um Benutzer zu erstellen (Bitte Zeile %d in der CSV-Datei überprüfen)!

source: Class: %s
de: Klasse: %s

source: Import Students (Only)
de: Nur Schüler Importieren

source: GOsa2 School Manager Module: Import Students (Only)
de: GOsa²-Schulverwaltungsmodul: Nur Schüler Importieren

source: With GOsa2 School Manager's <b>Import Students (Only) Module</b> you can import student user accounts, class groups and course groups from a single CSV file containing one user's account information per line.
de: Mit dem <b>Nur Schüler Importieren</b> Modul des GOsa² Schulverwaltungs-Add-Ons können Schüler/Studenten-Konten, Klassen- bzw. Kursgruppen aus einer CSV-Datei, in der pro Zeile die Daten eines Benutzerkontos stehen importiert werden.
